kiran-embedded/esp32-smart-light-app/firmware/complete_recovery_firmware.ino
/*
 * NEBULA CORE – COMPLETE SYSTEM (CLOUD-ONLY EDITION)
 * VERSION: v1.6.5-ULTIMATE-PRO-GOLD
 * ------------------------------------------------
 * STATUS LED LOGIC:
 * PRIORITY 1: OTA Update (Red/Blue Strobe).
 * PRIORITY 2: Data Flash (Blue) -> Overrides Status.
 * PRIORITY 3: Status (Green=OK, Red=No Network).
 *
 * FEATURES ADDED OVER SOLID BASE:
 * - Broadcast ESP-NOW (MAC-agnostic mesh)
 * - Proactive 4-zone PIR discovery on boot
 * - Real-time sensor telemetry to security/sensors
 * - Master LDR sync from heartbeat + motion
 * - LDR-gated Neural automation (no daylight triggers)
 * - Individual timer priority (App slider > global pirTimer)
 * - Standalone LDR-based relay automation
 * - Individual calibration path parsing (sensitivity/debounce)
 * - Rule-compliant JSON security logs
 * - testMesh simulation command
 * - Hub MAC / isNight / ch telemetry
 */

#include <ArduinoOTA.h>
#include <ESPmDNS.h>
#include <Firebase_ESP_Client.h>
#include <WiFi.h>
#include <WiFiUdp.h>
#include <esp_now.h>
#include <esp_task_wdt.h>
#include <map>
#include <set>
#include <time.h>

#include "addons/RTDBHelper.h"
#include "addons/TokenHelper.h"

/* ================= CONFIGURATION ================= */
#define WIFI_SSID "Kerala_Vision"
#define WIFI_PASS "chandrasekharan0039"
#define OTA_HOSTNAME "Nebula-Core-ESP32"
#define OTA_PASSWORD "nebula2024"
#define API_KEY "AIzaSyA9zs6xhRcEwwGLO6cI417b2FO52PiXaxs"
#define DATABASE_URL                                                           \
  "https://"                                                                   \
  "nebula-smartpowergrid-default-rtdb.asia-southeast1.firebasedatabase.app"

/* ================= PIN DEFINITIONS ================= */
#define RELAY1 26
#define RELAY2 27
#define RELAY3 25
#define RELAY4 33
#define RELAY5 32
#define RELAY6 14
#define RELAY7 23
#define VOLTAGE_SENSOR 34
#define BUZZER_PIN 13

#define LED_PIN_RED 19
#define LED_PIN_GREEN 16
#define LED_PIN_BLUE 17

/* ================= CONSTANTS ================= */
#define ADC_MAX 4095.0
#define VREF 3.3
float calibrationFactor = 313.3;
#define P2P_THRESHOLD 60
#define RMS_THRESHOLD 0.020
#define SMOOTHING_ALPHA 0.1
#define MANUAL_LOCKOUT_MS 5000
#define DEADMAN_TIMEOUT_MS 300000
#define LED_PULSE_MS 100

/* ================= GLOBALS ================= */
FirebaseData fbTele;
FirebaseData fbStream;
FirebaseAuth auth;
FirebaseConfig config;

bool isOTAActive = false;
bool isInternetLive = false;
String deviceId = "79215788";

bool relayState[7] = {0, 0, 0, 0, 0, 0, 0};
const int RELAY_PINS[7] = {RELAY1, RELAY2, RELAY3, RELAY4,
                           RELAY5, RELAY6, RELAY7};
bool invertedLogic[7] = {0, 0, 0, 0, 0, 0, 0};
String autoSensor[7] = {"", "", "", "", "", "", ""};
int autoDuration[7] = {0, 0, 0, 0, 0, 0, 0};
int autoThreshold[7] = {0, 0, 0, 0, 0, 0, 0};
bool autoActive[7] = {false, false, false, false, false, false, false};
unsigned long autoTriggerTime[7] = {0, 0, 0, 0, 0, 0, 0};
bool isNeuralTriggered[7] = {false, false, false, false, false, false, false};
unsigned long manualOverrideTime[7] = {0, 0, 0, 0, 0, 0, 0};

int pirTimer = 60;
int autoTimeMode[7] = {0, 0, 0, 0, 0, 0, 0};
int mapPIR[5] = {0, 0, 0, 0, 0};
int pirDetectionCount[5] = {2, 2, 2, 2, 2};
int pirDebounce[5] = {200, 200, 200, 200, 200};

bool activePeriods[5] = {true, true, true, true, true};
const char *periodNames[5] = {"morning", "afternoon", "evening", "night",
                              "midnight"};
std::map<String, int> sensorMode;

std::map<String, int> sensorDebounce;
std::map<String, int> sensorSensitivity;
std::map<String, int> sensorHitCounter;
std::map<String, unsigned long> lastTriggerTimeMap;
std::map<String, bool> sensorAlarmEnabled;
std::set<String> discoveredSensors;

bool updateRelays = false;
bool forceTelemetry = false;
volatile float sharedVoltage = 0.0;
unsigned long lastTelemetryTime = 0;
float lastReportedVoltage = 0;
bool isArmed = true;
bool isBuzzerMuted = false;
bool isLdrSecurityEnabled = false;
bool isAutoGlobalEnabled = true;
unsigned long blueLedOffTime = 0;
int globalLdrThreshold = 50;
bool isEcoMode = false;
int reportInterval = 8000;

String pathTele, pathEvents, pathCmds, pathSensors;
bool isActivityFlashing = false;
unsigned long activityStart = 0;
bool isPanicActive = false;
bool buzzerPending = false;
unsigned long buzzerStartTime = 0;
int buzzerDuration = 200;
unsigned long lastPanicPulse = 0;
bool safetyTripped = false;
unsigned long lastCloudActivity = 0;

/* ================= MESH STRUCTURE ================= */
typedef struct struct_message {
  char sensorId[16];
  bool motion;
  int lightLevel;
} struct_message;

struct_message incomingData;
volatile bool meshDataPending = false;

/* ================= LED ENGINE ================= */
void initLEDs() {
  pinMode(LED_PIN_RED, OUTPUT);
  pinMode(LED_PIN_GREEN, OUTPUT);
  pinMode(LED_PIN_BLUE, OUTPUT);
  digitalWrite(LED_PIN_RED, LOW);
  digitalWrite(LED_PIN_GREEN, LOW);
  digitalWrite(LED_PIN_BLUE, LOW);
}

void triggerActivityLED() {
  isActivityFlashing = true;
  activityStart = millis();
}

void animateLEDs() {
  unsigned long now = millis();
  if (blueLedOffTime > 0 && now > blueLedOffTime) {
    digitalWrite(LED_PIN_BLUE, LOW);
    blueLedOffTime = 0;
  }
  int targetColor = 0;

  if (isOTAActive) {
    targetColor = ((now / 100) % 2 == 0) ? 1 : 3;
  } else if (isActivityFlashing) {
    if (now - activityStart < 80)
      targetColor = 3;
    else
      isActivityFlashing = false;
  }

  if (targetColor == 0 && !isActivityFlashing && !isOTAActive) {
    if (WiFi.status() != WL_CONNECTED) {
      targetColor = ((now / 200) % 2 == 0) ? 2 : 3;
    } else if (!isInternetLive) {
      if ((now / 1500) % 2 == 0)
        targetColor = 1;
    } else {
      unsigned long cycle = now % (isEcoMode ? 4000 : 2000);
      if (cycle < 80 || (cycle > 250 && cycle < 330))
        targetColor = 2;
    }
  }

  digitalWrite(LED_PIN_RED, (targetColor == 1) ? HIGH : LOW);
  digitalWrite(LED_PIN_GREEN, (targetColor == 2) ? HIGH : LOW);
  if (blueLedOffTime > 0 && now < blueLedOffTime)
    digitalWrite(LED_PIN_BLUE, HIGH);
  else
    digitalWrite(LED_PIN_BLUE, (targetColor == 3) ? HIGH : LOW);

