kiran-embedded/esp32-smart-light-app/firmware/complete_recovery_firmware.ino
  if (isPanicActive) {
    if (now - lastPanicPulse > 500) {
      triggerBuzzer(250);
      lastPanicPulse = now;
    }
  }
  if (buzzerPending) {
    if (now - buzzerStartTime < buzzerDuration) {
      if (!isBuzzerMuted)
        digitalWrite(BUZZER_PIN, HIGH);
    } else {
      digitalWrite(BUZZER_PIN, LOW);
      buzzerPending = false;
    }
  }
  esp_task_wdt_reset();
}

void triggerBuzzer(int ms) {
  if (isBuzzerMuted && !isPanicActive)
    return;
  buzzerPending = true;
  buzzerStartTime = millis();
  buzzerDuration = ms;
}

/* ================= BACKGROUND TASKS ================= */
void connectivityTask(void *pvParameters) {
  for (;;) {
    int delayTime = isEcoMode ? 15000 : 8000;
    if (WiFi.status() != WL_CONNECTED) {
      isInternetLive = false;
      delayTime = 1000;
    } else if (!isInternetLive) {
      WiFiClient client;
      client.setTimeout(1500);
      if (client.connect("8.8.8.8", 53)) {
        isInternetLive = true;
        client.stop();
      } else {
        delayTime = 3000;
      }
    }
    vTaskDelay(delayTime / portTICK_PERIOD_MS);
  }
}

void voltageTask(void *pvParameters) {
  long sum = 0;
  for (int i = 0; i < 500; i++)
    sum += analogRead(VOLTAGE_SENSOR);
  float adcOffset = sum / 500.0;
  float localVoltage = 0;

  for (;;) {
    double rmsSum = 0;
    int rmsCount = 0;
    int rmsMin = 4095, rmsMax = 0;
    unsigned long burstStart = millis();
    while (millis() - burstStart < 20) {
      int raw = analogRead(VOLTAGE_SENSOR);
      if (raw < rmsMin)
        rmsMin = raw;
      if (raw > rmsMax)
        rmsMax = raw;
      float v = (raw - adcOffset) * (VREF / ADC_MAX);
      rmsSum += v * v;
      rmsCount++;
      yield();
    }
    if (rmsCount > 0) {
      int p2p = rmsMax - rmsMin;
      float rms = sqrt(rmsSum / rmsCount);
      float instVoltage = (p2p >= P2P_THRESHOLD && rms >= RMS_THRESHOLD)
                              ? (rms * calibrationFactor)
                              : 0.0;
      localVoltage = (localVoltage == 0)
                         ? instVoltage
                         : (instVoltage * SMOOTHING_ALPHA) +
                               (localVoltage * (1.0 - SMOOTHING_ALPHA));
      sharedVoltage = (localVoltage < 5.0) ? 0.0 : localVoltage;
    }
    vTaskDelay((isEcoMode ? 200 : 100) / portTICK_PERIOD_MS);
  }
}

/* ================= HARDWARE CONTROL ================= */
void applyRelays() {
  int pins[] = {RELAY1, RELAY2, RELAY3, RELAY4, RELAY5, RELAY6, RELAY7};
  for (int i = 0; i < 7; i++) {
    bool target = (relayState[i] != invertedLogic[i]);
    digitalWrite(pins[i], target ? HIGH : LOW);
  }
}

void triggerHardware() {
  updateRelays = true;
  applyRelays();
  updateRelays = false;
}

/* ================= STREAM CALLBACK ================= */
void streamCallback(FirebaseStream data) {
  digitalWrite(LED_PIN_BLUE, HIGH);
  blueLedOffTime = millis() + LED_PULSE_MS;
  isInternetLive = true;
  lastCloudActivity = millis();
  String path = data.dataPath();
  bool wasRelayUpdated = false;

  if (path == "/") {
    FirebaseJson *json = data.jsonObjectPtr();
    if (!json)
      return;
    FirebaseJsonData d;
    if (json->get(d, "relay1")) {
      if (relayState[0] != (bool)d.intValue) {
        relayState[0] = d.intValue;
        wasRelayUpdated = true;
      }
    }
    if (json->get(d, "relay2")) {
      if (relayState[1] != (bool)d.intValue) {
        relayState[1] = d.intValue;
        wasRelayUpdated = true;
      }
    }
    if (json->get(d, "relay3")) {
      if (relayState[2] != (bool)d.intValue) {
        relayState[2] = d.intValue;
        wasRelayUpdated = true;
      }
    }
    if (json->get(d, "relay4")) {
      if (relayState[3] != (bool)d.intValue) {
        relayState[3] = d.intValue;
        wasRelayUpdated = true;
      }
    }
    if (json->get(d, "relay5")) {
      if (relayState[4] != (bool)d.intValue) {
        relayState[4] = d.intValue;
        wasRelayUpdated = true;
      }
    }
    if (json->get(d, "relay6")) {
      if (relayState[5] != (bool)d.intValue) {
        relayState[5] = d.intValue;
        wasRelayUpdated = true;
      }
    }
    if (json->get(d, "relay7")) {
      if (relayState[6] != (bool)d.intValue) {
        relayState[6] = d.intValue;
        wasRelayUpdated = true;
      }
    }

    if (json->get(d, "invert1"))
      invertedLogic[0] = d.boolValue;
    if (json->get(d, "invert2"))
      invertedLogic[1] = d.boolValue;
    if (json->get(d, "invert3"))
      invertedLogic[2] = d.boolValue;
    if (json->get(d, "invert4"))
      invertedLogic[3] = d.boolValue;
    if (json->get(d, "invert5"))
      invertedLogic[4] = d.boolValue;
    if (json->get(d, "invert6"))
      invertedLogic[5] = d.boolValue;
    if (json->get(d, "invert7"))
      invertedLogic[6] = d.boolValue;

    if (json->get(d, "ecoMode"))
      isEcoMode = d.boolValue;
    if (json->get(d, "panic")) {
      isPanicActive = d.boolValue;
      if (isPanicActive)
        triggerBuzzer(1000);
    }
    if (json->get(d, "isArmed") || json->get(d, "security/isArmed")) {
      isArmed = d.boolValue;
      if (!isArmed) {
        Firebase.RTDB.deleteNode(
            &fbTele,
            ("devices/" + deviceId + "/security/activeBreaches").c_str());
        Firebase.RTDB.setBoolAsync(
            &fbTele, ("devices/" + deviceId + "/security/alarmActive").c_str(),
            false);
      }
    }
    if (json->get(d, "buzzerMute"))
      isBuzzerMuted = d.boolValue;
    if (json->get(d, "ldrThreshold"))
      globalLdrThreshold = d.intValue;
    if (json->get(d, "ldrSecurity"))
      isLdrSecurityEnabled = d.boolValue;
    if (json->get(d, "pirTimer"))
      pirTimer = d.intValue;

    if (json->get(d, "autoGlobal") || json->get(d, "autoLightOnMotion") ||
        json->get(d, "security/autoGlobal") ||
        json->get(d, "security/autoLightOnMotion"))
      isAutoGlobalEnabled = d.boolValue;
    if (json->get(d, "ldrThreshold"))
      globalLdrThreshold = d.intValue;
    if (json->get(d, "buzzerMute"))
      isBuzzerMuted = d.boolValue;

    for (int i = 1; i <= 4; i++) {
      char key[16], sKey[48], dKey[48], mKey[48];
      sprintf(key, "mapPIR%d", i);
      sprintf(sKey, "security/calibration/PIR%d/sensitivity", i);
      sprintf(dKey, "security/calibration/PIR%d/debounce", i);
      sprintf(mKey, "security/calibration/PIR%d/mode", i);
      if (json->get(d, key))
        mapPIR[i - 1] = d.intValue;
      if (json->get(d, sKey))
        pirDetectionCount[i - 1] = d.intValue;
      if (json->get(d, dKey))
        pirDebounce[i - 1] = d.intValue;
      if (json->get(d, mKey))
        sensorMode["PIR" + String(i)] = d.intValue;
    }
    for (int i = 0; i < 5; i++) {
      char pKey[32];
      sprintf(pKey, "security/activePeriods/%s", periodNames[i]);
      if (json->get(d, pKey))
        activePeriods[i] = d.boolValue;
    }
    for (int i = 1; i <= 4; i++) {
      char sPath[48];
      sprintf(sPath, "security/sensors/PIR%d/isAlarmEnabled", i);
      if (json->get(d, sPath))
        sensorAlarmEnabled["PIR" + String(i)] = d.boolValue;
    }
    for (int i = 1; i <= 7; i++) {
      char sKey[16], dKey[16], tKey[16], aKey[16], mKey[16];
      sprintf(sKey, "auto_r%d_sen", i);
      sprintf(dKey, "auto_r%d_dur", i);
      sprintf(tKey, "auto_r%d_thr", i);
      sprintf(aKey, "auto_r%d_act", i);
      sprintf(mKey, "auto_r%d_tm", i);
      if (json->get(d, sKey))
        autoSensor[i - 1] = d.stringValue;
      if (json->get(d, dKey))
        autoDuration[i - 1] = d.intValue;
      if (json->get(d, tKey))
        autoThreshold[i - 1] = d.intValue;
      if (json->get(d, aKey))
        autoActive[i - 1] = d.boolValue;
      if (json->get(d, mKey))
        autoTimeMode[i - 1] = d.intValue;
    }

    // 🧪 TEST MESH SIMULATION
    if (json->get(d, "testMesh") && d.boolValue) {
      strcpy(incomingData.sensorId, "PIR1");
      incomingData.motion = true;
      incomingData.lightLevel = 45;
      meshDataPending = true;
      Firebase.RTDB.setBoolAsync(&fbTele, (pathCmds + "/testMesh").c_str(),
                                 false);
      FirebaseJson testLog;
      testLog.set("sensor", "PIR1-TEST");
      testLog.set("timestamp", (int)time(NULL));
      Firebase.RTDB.pushJSONAsync(&fbTele, pathEvents.c_str(), &testLog);
    }
  } else {
    // === INDIVIDUAL PATH UPDATES ===
    if (path.startsWith("/relay")) {
      int idx = path.substring(6).toInt() - 1;
      if (idx >= 0 && idx < 7) {
        if (relayState[idx] != (bool)data.intData()) {
          relayState[idx] = data.intData();
          wasRelayUpdated = true;
        }
      }
    } else if (path == "/isArmed" || path == "/security/isArmed") {
      isArmed = data.boolData();
    } else if (path == "/panic" || path == "/security/panic") {
      isPanicActive = data.boolData();
      if (isPanicActive)
        triggerBuzzer(1000);
    } else if (path == "/ldrThreshold" || path == "/security/ldrThreshold") {
      globalLdrThreshold = data.intData();
    } else if (path == "/buzzerMute" || path == "/security/buzzerMute") {
      isBuzzerMuted = data.boolData();
    } else if (path.startsWith("/security/calibration/PIR")) {
      int pIdx = path.substring(25, 26).toInt() - 1;
      if (pIdx >= 0 && pIdx < 4) {
        if (path.endsWith("/sensitivity"))
          pirDetectionCount[pIdx] = data.intData();
        else if (path.endsWith("/debounce"))
          pirDebounce[pIdx] = data.intData();
        else if (path.endsWith("/mode"))
          sensorMode["PIR" + String(pIdx + 1)] = data.intData();
      }
    } else if (path.startsWith("/security/sensors/")) {
      String sid = path.substring(18);
      int slash = sid.indexOf('/');
      if (slash > 0) {
        String baseSid = sid.substring(0, slash);
        String attr = sid.substring(slash + 1);
        if (attr == "isAlarmEnabled") {
          sensorAlarmEnabled[baseSid] = data.boolData();
        }
      }
    } else if (path.startsWith("/security/activePeriods/")) {
      String pName = path.substring(24);
      for (int i = 0; i < 5; i++) {
        if (pName == periodNames[i]) {
          activePeriods[i] = data.boolData();
          break;
        }
      }
    } else if (path.startsWith("/mapPIR")) {
      int pIdx = path.substring(7).toInt() - 1;
      if (pIdx >= 0 && pIdx < 4)
        mapPIR[pIdx] = data.intData();
    } else if (path == "/pirTimer" || path == "/security/pirTimer") {
      pirTimer = data.intData();
    } else if (path == "/ldrThreshold" || path == "/security/ldrThreshold") {
      globalLdrThreshold = data.intData();
    } else if (path == "/ldrSecurity" || path == "/security/ldrSecurity") {
      isLdrSecurityEnabled = data.boolData();
    } else if (path == "/autoGlobal" || path == "/security/autoGlobal" ||
               path == "/autoLightOnMotion" ||
               path == "/security/autoLightOnMotion") {
      isAutoGlobalEnabled = data.boolData();
    } else if (path == "/ecoMode") {
      isEcoMode = data.boolData();
    }
  }

  if (wasRelayUpdated) {
    unsigned long lockout_now = millis();
    for (int i = 0; i < 7; i++)
      manualOverrideTime[i] = lockout_now;
  }
  triggerHardware();
  lastTelemetryTime = millis() - reportInterval + 500;
  triggerActivityLED();
}

void streamTimeoutCallback(bool timeout) {
  if (timeout)
    isInternetLive = false;
}

