kiran-embedded/esp32-smart-light-app/firmware/complete_recovery_firmware.ino
/* ================= ESP-NOW CALLBACK ================= */
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
void OnDataRecv(const esp_now_recv_info *info, const uint8_t *data, int len) {
#else
void OnDataRecv(const uint8_t *mac_addr, const uint8_t *data, int len) {
#endif
  memcpy(&incomingData, data, sizeof(incomingData));
  meshDataPending = true;
}

/* ================= SETUP ================= */
void setup() {
  Serial.begin(115200);
  delay(500);
  initLEDs();

  pinMode(RELAY1, OUTPUT);
  pinMode(RELAY2, OUTPUT);
  pinMode(RELAY3, OUTPUT);
  pinMode(RELAY4, OUTPUT);
  pinMode(RELAY5, OUTPUT);
  pinMode(RELAY6, OUTPUT);
  pinMode(RELAY7, OUTPUT);
  pinMode(BUZZER_PIN, OUTPUT);

  analogReadResolution(12);
  analogSetAttenuation(ADC_11db);

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.begin(WIFI_SSID, WIFI_PASS);

  pathTele = "devices/" + deviceId + "/telemetry";
  pathEvents = "devices/" + deviceId + "/security/logs";
  pathCmds = "devices/" + deviceId + "/commands";
  pathSensors = "devices/" + deviceId + "/security/sensors";

  unsigned long startT = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startT < 10000) {
    delay(100);
    animateLEDs();
  }

  if (WiFi.status() == WL_CONNECTED) {
    configTime(19800, 0, "pool.ntp.org");
    xTaskCreatePinnedToCore(connectivityTask, "ConnTask", 2048, NULL, 1, NULL,
                            0);
    // 🔊 Boot hardware test beeps
    for (int i = 0; i < 3; i++) {
      digitalWrite(BUZZER_PIN, HIGH);
      delay(50);
      digitalWrite(BUZZER_PIN, LOW);
      delay(50);
    }
  }

  ArduinoOTA.setHostname(OTA_HOSTNAME);
  ArduinoOTA.setPassword(OTA_PASSWORD);

  ArduinoOTA.onStart([]() {
    isOTAActive = true;
// 🛡️ DE-INITIALIZE WATCHDOG FOR FLASH SAFETY
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    esp_task_wdt_delete(NULL);
    esp_task_wdt_deinit();
#else
    esp_task_wdt_delete(NULL);
#endif

    // 🔇 SILENCE PERIPHERALS
    digitalWrite(BUZZER_PIN, LOW);
    for (int i = 0; i < 7; i++) {
      digitalWrite(RELAY_PINS[i], LOW);
      relayState[i] = 0;
    }
  });

  ArduinoOTA.onEnd([]() { isOTAActive = false; });

  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    // 🧪 FLASH VISUAL FEEDBACK (Magenta Strobe - No pixels dependency)
    digitalWrite(LED_PIN_RED, HIGH);
    digitalWrite(LED_PIN_BLUE, HIGH);
    digitalWrite(LED_PIN_GREEN, LOW);
  });

  ArduinoOTA.onError([](ota_error_t error) { isOTAActive = false; });

  ArduinoOTA.begin();

  config.api_key = API_KEY;
  config.database_url = DATABASE_URL;
  config.token_status_callback = tokenStatusCallback;
  Firebase.signUp(&config, &auth, "", "");
  Firebase.begin(&config, &auth);

  Firebase.RTDB.beginStream(&fbStream, pathCmds.c_str());
  Firebase.RTDB.setStreamCallback(&fbStream, streamCallback,
                                  streamTimeoutCallback);

  // 🛰 BROADCAST ESP-NOW (MAC-agnostic mesh)
  if (esp_now_init() == ESP_OK) {
    esp_now_register_recv_cb(OnDataRecv);
    esp_now_peer_info_t peerInfo = {};
    memset(peerInfo.peer_addr, 0xFF, 6);
    peerInfo.channel = 0;
    peerInfo.encrypt = false;
    esp_now_add_peer(&peerInfo);
  }
  xTaskCreatePinnedToCore(voltageTask, "VoltageTask", 5120, NULL, 1, NULL, 0);

  // 📡 OTA DIAGNOSTICS
  Serial.print("📡 HUB MAC: ");
  Serial.println(WiFi.macAddress());
  Firebase.RTDB.setStringAsync(&fbTele, (pathTele + "/hubMac").c_str(),
                               WiFi.macAddress());

  // 🛡️ PROACTIVE 4-ZONE DISCOVERY (Force-create sensor slots)
  Firebase.RTDB.setBoolAsync(
      &fbTele, ("devices/" + deviceId + "/security/bootSignal").c_str(), true);
  for (int i = 1; i <= 4; i++) {
    String p = "PIR" + String(i);
    FirebaseJson initData;
    initData.set("status", false);
    initData.set("lightLevel", 0);
    Firebase.RTDB.setJSONAsync(&fbTele, (pathSensors + "/" + p).c_str(),
                               &initData);
    FirebaseJson disc;
    disc.set("name", p);
    Firebase.RTDB.updateNodeAsync(
        &fbTele,
        ("devices/" + deviceId + "/security/discovery/pending/" + p).c_str(),
        &disc);
    discoveredSensors.insert(p);
  }
  Firebase.RTDB.setIntAsync(
      &fbTele, ("devices/" + deviceId + "/security/masterLDR").c_str(), 0);

  // === WATCHDOG INITIALIZATION (Cross-Core Compatible) ===
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  esp_task_wdt_config_t twdt_config = {
      .timeout_ms = 60000,
      .idle_core_mask = (1 << portNUM_PROCESSORS) - 1,
      .trigger_panic = true,
  };
  esp_task_wdt_init(&twdt_config);
#else
  esp_task_wdt_init(60, true);
#endif
  esp_task_wdt_add(NULL);

  Firebase.RTDB.deleteNode(
      &fbTele, ("devices/" + deviceId + "/security/activeBreaches").c_str());
  Firebase.RTDB.deleteNode(&fbTele, pathEvents.c_str());

  Serial.println("✅ SYSTEM READY.");
  lastCloudActivity = millis();
}

/* ================= HELPERS ================= */
int getCurrentPeriodIdx() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo))
    return -1;
  int h = timeinfo.tm_hour;
  if (h >= 6 && h < 12)
    return 0;
  if (h >= 12 && h < 17)
    return 1;
  if (h >= 17 && h < 20)
    return 2;
  if (h >= 20 && h <= 23)
    return 3;
  return 4;
}

void processMeshData() {
  if (!meshDataPending)
    return;
  unsigned long now = millis();
  String sid = String(incomingData.sensorId);
  int curP = getCurrentPeriodIdx();
  bool isScheduled = (curP == -1 || activePeriods[curP]);

  int debounceVal = 800;
  if (sensorDebounce.count(sid))
    debounceVal = sensorDebounce[sid];
  int pIdx = (sid.startsWith("PIR") && sid.length() >= 4)
                 ? (sid.substring(3).toInt() - 1)
                 : -1;
  if (pIdx >= 0 && pIdx < 4)
    debounceVal = pirDebounce[pIdx];

  // SOFTWARE DEBOUNCE
  if (incomingData.motion &&
      (now - lastTriggerTimeMap[sid] < (unsigned long)debounceVal)) {
    meshDataPending = false;
    return;
  }

  // 🛡️ VERBOSE DEBUGGING
  Serial.printf("📡 Hub Mesh: ID=%s | Motion=%d | LDR=%d\n", sid.c_str(),
                incomingData.motion, incomingData.lightLevel);
  Firebase.RTDB.setStringAsync(&fbTele, (pathTele + "/lastNode").c_str(), sid);
  Firebase.RTDB.setIntAsync(&fbTele, (pathTele + "/lastNodeLdr").c_str(),
                            incomingData.lightLevel);

  // 🛡️ AUTO-DISCOVERY (Announce to App if new)
  if (discoveredSensors.find(sid) == discoveredSensors.end()) {
    FirebaseJson disc;
    disc.set("name", sid);
    Firebase.RTDB.updateNodeAsync(
        &fbTele,
        ("devices/" + deviceId + "/security/discovery/pending/" + sid).c_str(),
        &disc);
    discoveredSensors.insert(sid);
  }

