kiran-embedded/esp32-smart-light-app/firmware/complete_recovery_firmware.ino
  // 🛡️ REAL-TIME SENSOR TELEMETRY (For App Dynamic UI)
  FirebaseJson sensorData;
  sensorData.set("status", incomingData.motion);
  sensorData.set("lightLevel", incomingData.lightLevel);
  if (incomingData.motion)
    sensorData.set("lastTriggered", (int)time(NULL));
  Firebase.RTDB.setJSONAsync(&fbTele, (pathSensors + "/" + sid).c_str(),
                             &sensorData);

  // 🌓 Update Master LDR (Heartbeat + Motion)
  if (sid.startsWith("PIR") || sid == "NODE_GOLD") {
    Firebase.RTDB.setIntAsync(
        &fbTele, ("devices/" + deviceId + "/security/masterLDR").c_str(),
        incomingData.lightLevel);
  }

  if (incomingData.motion) {
    // 🎯 SENSITIVITY CALIBRATION
    int reqHits = 2;
    if (pIdx >= 0 && pIdx < 4)
      reqHits = pirDetectionCount[pIdx];

    sensorHitCounter[sid]++;
    lastTriggerTimeMap[sid] = now;

    if (sensorHitCounter[sid] >= reqHits) {
      // 🌓 Mode Validation
      int mode = 2; // Default Hybrid
      if (sensorMode.count(sid))
        mode = sensorMode[sid];

      bool isLdrOk = (incomingData.lightLevel <= globalLdrThreshold);
      bool isTimeOk = isScheduled;
      bool canTrigger = false;

      if (mode == 0)
        canTrigger = isLdrOk;
      else if (mode == 1)
        canTrigger = isTimeOk;
      else
        canTrigger = (isLdrOk && isTimeOk);

      if (!canTrigger) {
        sensorHitCounter[sid] = 0;
        meshDataPending = false;
        return;
      }
      Serial.printf("📡 Hub Received: %s | Motion: %d | Hits: %d/%d\n",
                    sid.c_str(), incomingData.motion, sensorHitCounter[sid],
                    reqHits);

      // 🧠 NEURAL HUB AUTOMATION (LDR Gated)
      if (isAutoGlobalEnabled &&
          (incomingData.lightLevel <= globalLdrThreshold)) {
        if (pIdx >= 0 && pIdx < 4) {
          int mask = mapPIR[pIdx];
          for (int r = 0; r < 7; r++) {
            if (now - manualOverrideTime[r] < MANUAL_LOCKOUT_MS)
              continue;
            if ((mask & (1 << r)) != 0) {
              relayState[r] = 1;
              autoTriggerTime[r] = now;
              isNeuralTriggered[r] = true;
              updateRelays = true;
            }
          }
        }
      }

      // 🛡 SECURITY ALARM LOGIC (Rule-Compliant JSON Logs)
      bool sensorEnabled = true;
      if (sensorAlarmEnabled.count(sid))
        sensorEnabled = sensorAlarmEnabled[sid];

      if (isArmed && isScheduled && sensorEnabled) {
        if (!isLdrSecurityEnabled ||
            incomingData.lightLevel <= globalLdrThreshold) {
          triggerBuzzer(400);
          FirebaseJson breachLog;
          breachLog.set("sensor", sid);
          breachLog.set("timestamp", (int)time(NULL));
          Firebase.RTDB.pushJSONAsync(&fbTele, pathEvents.c_str(), &breachLog);

          // 🚨 ACTIVE BREACH AGGREGATION
          Firebase.RTDB.setBoolAsync(
              &fbTele,
              ("devices/" + deviceId + "/security/activeBreaches/" + sid)
                  .c_str(),
              true);
          Firebase.RTDB.setBoolAsync(
              &fbTele,
              ("devices/" + deviceId + "/security/alarmActive").c_str(), true);
          // 🌔 Master LDR Telemetry Sync
          Firebase.RTDB.setIntAsync(
              &fbTele, ("devices/" + deviceId + "/security/masterLDR").c_str(),
              incomingData.lightLevel);
        }
      }
      sensorHitCounter[sid] = 0;
    }
  } else {
    sensorHitCounter[sid] = 0;
  }

  // 🛡️ STANDALONE LDR AUTOMATION ENGINE
  for (int r = 0; r < 7; r++) {
    if (autoActive[r] && autoSensor[r] == "ldr") {
      if (incomingData.lightLevel <= autoThreshold[r]) {
        if (!relayState[r]) {
          relayState[r] = 1;
          autoTriggerTime[r] = millis();
          updateRelays = true;
        }
      } else {
        if (relayState[r]) {
          relayState[r] = 0;
          updateRelays = true;
        }
      }
    }
  }

  meshDataPending = false;
}

/* ================= LOOP ================= */
void loop() {
  animateLEDs();
  ArduinoOTA.handle();
  if (updateRelays) {
    applyRelays();
    updateRelays = false;
  }

  static unsigned long lastWiFiCheck = 0;
  if (millis() - lastWiFiCheck > 20000) {
    lastWiFiCheck = millis();
    if (WiFi.status() != WL_CONNECTED)
      WiFi.reconnect();
  }

  static unsigned long lastTeleCheck = 0;
  if (millis() - lastTeleCheck > (isEcoMode ? 2000 : 500)) {
    lastTeleCheck = millis();
    if (forceTelemetry || (millis() - lastTelemetryTime > reportInterval)) {
      if (Firebase.ready() && isInternetLive) {
        FirebaseJson j;
        for (int i = 0; i < 7; i++) {
          char k[8];
          sprintf(k, "relay%d", i + 1);
          j.set(k, relayState[i]);
        }
        j.set("voltage", sharedVoltage);
        j.set("heap", (int)ESP.getFreeHeap());
        j.set("isNight", incomingData.lightLevel < globalLdrThreshold);
        j.set("ch", (int)WiFi.channel());
        if (Firebase.RTDB.updateNodeAsync(&fbTele, pathTele.c_str(), &j)) {
          lastTelemetryTime = millis();
          lastCloudActivity = millis();
          forceTelemetry = false;

          // 💓 Vitality Heartbeat & Alarm Cleanup
          FirebaseJson status;
          status.set("online", true);
          status.set("lastSeen", (int)time(NULL));
          status.set("rssi", (int)WiFi.RSSI());
          status.set("ldrValid", true);
          Firebase.RTDB.updateNodeAsync(
              &fbTele, ("devices/" + deviceId + "/status").c_str(), &status);

          if (!isPanicActive) {
            Firebase.RTDB.setBoolAsync(
                &fbTele,
                ("devices/" + deviceId + "/security/alarmActive").c_str(),
                false);
          }
        }
      }
    }
  }

  // ⏱ AUTOMATION TIMER ENGINE (Individual Priority)
  for (int i = 0; i < 7; i++) {
    if (relayState[i] == 0) {
      autoTriggerTime[i] = 0;
      isNeuralTriggered[i] = false;
      continue;
    }
    // Individual App timer takes priority; fallback to global pirTimer
    unsigned long dur =
        (autoDuration[i] > 0)
            ? ((unsigned long)autoDuration[i] * 1000UL)
            : (isNeuralTriggered[i] ? ((unsigned long)pirTimer * 1000UL) : 0);
    if (dur > 0 && autoTriggerTime[i] > 0 &&
        (millis() - autoTriggerTime[i] > dur)) {
      relayState[i] = 0;
      autoTriggerTime[i] = 0;
      isNeuralTriggered[i] = false;
      updateRelays = true;
      forceTelemetry = true;
    }
  }

  processMeshData();

  // DEADMAN'S SWITCH
  if (millis() - lastCloudActivity > DEADMAN_TIMEOUT_MS) {
    if (!safetyTripped) {
      for (int i = 0; i < 7; i++)
        relayState[i] = 0;
      updateRelays = true;
      safetyTripped = true;
    }
  } else {
    safetyTripped = false;
  }

  delay(isEcoMode ? 10 : 2);
  esp_task_wdt_reset();
}
